# пока не закончила

# Дан следующий словарь, представляющий инвентарь персонажа игры:
inventory = {
    'золото' : 500,
    'кошель' : ['алмаз', 'брильянт', 'самоцвет'],
    'сумка' : ['ксилофон', 'кинжал', 'спальный мешок', 'буханка хлеба']
}
# Проделайте следующие модификации со словарём inventory, используя операторы и методы
# классов dict и list:

# добавьте ключ с названием "карман"; по ключу "карман" сохраните список, 
# содержащий следующие строки: "ракушки", "ягода" и "платок"
inventory["карман"] = ["ракушки", "ягода", "платок"]

# отсортируйте список, хранящийся по ключу сумка
inventory['сумка'] = sorted(inventory['сумка'])

# удалите "кинжал" из списка, который хранится по ключу "сумка"
lst = inventory['сумка']
lst.remove("кинжал")
inventory['сумка'] = lst

# добавьте 50 к числу, которое хранится по ключу "золото"
m = inventory["золото"]
m += 50
inventory["золото"] = m

# Выведите на экран обновлённый словарь inventory.

print(inventory)


