# Представьте, что вы шпионы)
# Придумайте шифр, в котором буквы заменяются на какие-то символы
# и реализуйте шифроватор и дешифроватор

alphabet = {
    'а': '@',
    'б': '',
    'в': '',
    'г': '',
    'д': '',
    'е': '',
    'ё': '',
    'ж': '',
    'з': '',
    'и': '',
    'й': '',
    'к': '',
    'л': '',
    'м': '',
    'н': '',
    'о': '',
    'п': '',
    'р': '',
    'с': '',
    'т': '',
    'у': '',
    'ф': '',
    'х': '',
    'ц': '',
    'ч': '',
    'ш': '',
    'щ': '',
    'ъ': '',
    'ы': '',
    'ь': '',
    'э': '',
    'ю': '',
    'я': ''
}